OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f86j60.h
/*
 * This declarations of the PIC18F86J60 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:38 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC18F86J60_H__
#define __PIC18F86J60_H__

//==============================================================================

//==============================================================================
//
//	Register Definitions
//
//==============================================================================

extern __at(0x0E80) __sfr MAADR5;
extern __at(0x0E81) __sfr MAADR6;
extern __at(0x0E82) __sfr MAADR3;
extern __at(0x0E83) __sfr MAADR4;
extern __at(0x0E84) __sfr MAADR1;
extern __at(0x0E85) __sfr MAADR2;

//==============================================================================
//        MISTAT Bits

extern __at(0x0E8A) __sfr MISTAT;

typedef struct
  {
  unsigned BUSY                 : 1;
  unsigned SCAN                 : 1;
  unsigned NVALID               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __MISTATbits_t;

extern __at(0x0E8A) volatile __MISTATbits_t MISTATbits;

#define _BUSY                   0x01
#define _SCAN                   0x02
#define _NVALID                 0x04

//==============================================================================


//==============================================================================
//        EFLOCON Bits

extern __at(0x0E97) __sfr EFLOCON;

typedef union
  {
  struct
    {
    unsigned FCEN0              : 1;
    unsigned FCEN1              : 1;
    unsigned FULDPXS            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned FCEN               : 2;
    unsigned                    : 6;
    };
  } __EFLOCONbits_t;

extern __at(0x0E97) volatile __EFLOCONbits_t EFLOCONbits;

#define _FCEN0                  0x01
#define _FCEN1                  0x02
#define _FULDPXS                0x04

//==============================================================================

extern __at(0x0E98) __sfr EPAUS;
extern __at(0x0E98) __sfr EPAUSL;
extern __at(0x0E99) __sfr EPAUSH;

//==============================================================================
//        MACON1 Bits

extern __at(0x0EA0) __sfr MACON1;

typedef struct
  {
  unsigned MARXEN               : 1;
  unsigned PASSALL              : 1;
  unsigned RXPAUS               : 1;
  unsigned TXPAUS               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __MACON1bits_t;

extern __at(0x0EA0) volatile __MACON1bits_t MACON1bits;

#define _MARXEN                 0x01
#define _PASSALL                0x02
#define _RXPAUS                 0x04
#define _TXPAUS                 0x08

//==============================================================================


//==============================================================================
//        MACON3 Bits

extern __at(0x0EA2) __sfr MACON3;

typedef union
  {
  struct
    {
    unsigned FULDPX             : 1;
    unsigned FRMLNEN            : 1;
    unsigned HFRMEN             : 1;
    unsigned PHDREN             : 1;
    unsigned TXCRCEN            : 1;
    unsigned PADCFG0            : 1;
    unsigned PADCFG1            : 1;
    unsigned PADCFG2            : 1;
    };

  struct
    {
    unsigned                    : 5;
    unsigned PADCFG             : 3;
    };
  } __MACON3bits_t;

extern __at(0x0EA2) volatile __MACON3bits_t MACON3bits;

#define _FULDPX                 0x01
#define _FRMLNEN                0x02
#define _HFRMEN                 0x04
#define _PHDREN                 0x08
#define _TXCRCEN                0x10
#define _PADCFG0                0x20
#define _PADCFG1                0x40
#define _PADCFG2                0x80

//==============================================================================


//==============================================================================
//        MACON4 Bits

extern __at(0x0EA3) __sfr MACON4;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned DEFER                : 1;
  unsigned                      : 1;
  } __MACON4bits_t;

extern __at(0x0EA3) volatile __MACON4bits_t MACON4bits;

#define _DEFER                  0x40

//==============================================================================


//==============================================================================
//        MABBIPG Bits

extern __at(0x0EA4) __sfr MABBIPG;

typedef union
  {
  struct
    {
    unsigned BBIPG0             : 1;
    unsigned BBIPG1             : 1;
    unsigned BBIPG2             : 1;
    unsigned BBIPG3             : 1;
    unsigned BBIPG4             : 1;
    unsigned BBIPG5             : 1;
    unsigned BBIPG6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned BBIPG              : 7;
    unsigned                    : 1;
    };
  } __MABBIPGbits_t;

extern __at(0x0EA4) volatile __MABBIPGbits_t MABBIPGbits;

#define _BBIPG0                 0x01
#define _BBIPG1                 0x02
#define _BBIPG2                 0x04
#define _BBIPG3                 0x08
#define _BBIPG4                 0x10
#define _BBIPG5                 0x20
#define _BBIPG6                 0x40

//==============================================================================

